{
    "intents": [

        {
            "tag": "google",
            "patterns": [
                "google",
                "search",
                "cari",
                "internet"
            ],
            "responses": [
                "Redirecting to Google..."
            ]
        },
        {
            "tag": "mendefinisikanmasalahperasaan",
            "patterns": [
                "tertekan"
            ],
            "responses": [
                "Saya turut prihatin. Saran saya anda harus dapat mengatasi stres, kecemasan, dan pentingnya mempercayai Tuhan dalam situasi sulit. Salah satu ayat yang sesuai dengan kondisi anda adalah:Filipi 4:6-7 (TB):\"Janganlah hendaknya kamu kuatir tentang apapun juga, tetapi nyatakanlah dalam segala hal keinginanmu kepada Allah dalam doa dan permohonan dengan ucapan syukur. Dan damailah, yang melampaui segala akal, akan memelihara hati dan pikiranmu dalam Kristus Yesus.\" Ayat ini mengajak untuk melepaskan kekhawatiran kepada Tuhan melalui doa dan ucapan syukur serta meyakini bahwa damai sejahtera yang datang dari Tuhan akan melindungi hati dan pikiran kita. Ini adalah ayat yang menguatkan bahwa iman dalam Tuhan dapat membantu mengatasi stres dan ketidakpastian."
				         ]
        },
        {
            "tag": "tahappersiapan",
            "patterns": [
                "tahap persiapan",
                "mengulang kuliah"
            ],
            "responses": [
                "Mahasiswa yang telah lulus tahap persiapan tidak diperkenankan mengulang matakuliah pada tahap persiapan",
				"Mahasiswa tidak diperkenankan untuk mengulang matakuliah semester 1 dan 2 jika sudah lulus (minimal C)"
            ]
        },
        {
            "tag": "angkatan",
            "patterns": [
                "mahasiswa angkatan",
                "mhs angkatan"
            ],
            "responses": [
				"Terkait dengan angkatan mahasiswa, sebutkan tahunnya. Misal angkatan 2020."
            ]
        },
        {
            "tag": "contactperson",
            "patterns": [
                "contact person",
                "tidak dapat kelas",
                "hubungi mbak vian",
                "kelas penuh",
                "help desk"
            ],
            "responses": [
				"Mahasiswa yang tidak mendapat kelas matakuliah UPMB dapat menghubungi mbak Vian.",
				"Mahasiswa yang tidak mendapat kelas dapat menghubungi mbak Vian."
            ]
        },
        {
            "tag": "matakuliahumum",
            "patterns": [
                "matakuliah umum",
                "fisika",
                "kimia",
                "matematika"
            ],
            "responses": [
				"1. Menyisakan SKS untuk matakuliah umum.\n2. Mahasiswa langsung menghubungi SKPB (Subdirektorat Koordinasi Perkuliahan Bersama).\n3. Petugas SKPB akan memasukkan matakuliah yang akan diambil."
            ]
        },
        {
            "tag": "kkntematik",
            "patterns": [
                "kkn tematik",
                "konversi kkn"
            ],
            "responses": [
				"KKN Tematik merupakan kegiatan yang bersifat edukatif dengan melibatkan mahasiswa dalam kehidupan masyarakat.\n1. KKN Tematik dapat berupa kegiatan ABMAS dosen (KKN DRPM) yang melibatkan mahasiswa\n2. Pengambilan MK KKN Tematik dapat dilakukan dengan mengambil dari drop down kelas SKPB.\n3. Kegiatan di luar KKN DRPM (magang, praktik kerja, wirausaha, dll) dapat dikonversi sebagai MK KKN Tematik dengan mengambil kelas MBKM.\n4. MK KKN Tematik masih merupakan MK Pengayaan."
            ]
        },
        {
            "tag": "tahunpertama",
            "patterns": [
                "tahun pertama",
                "semester satu",
                "semester dua",
                "semester pertama",
                "semester kedua"
            ],
            "responses": [
				"Untuk mahasiswa tahun pertama, agar diperhatikan sbb:\n1. Mata kuliah yang diambil paket.\n2. Tidak boleh mengulang matakuliah semester 1.\n3. Agar mampu menjalani proses transisi dari pembelajar di SMA ke pembelajar mandiri di ITS\n4. Disarankan menambah matakuliah Statistika. S&K tetap berlaku."
            ]
        },
        {
            "tag": "tahunkedua",
            "patterns": [
                "tahun kedua",
                "semester tiga",
                "semester empat",
                "semester ketiga",
                "semester keempat"
            ],
            "responses": [
				"Untuk mahasiswa tahun kedua, agar diperhatikan sbb:\n1. Disarankan untuk mengambil matakuliah SKPB (MATH, FISIKA, KIMIA) apabila belum lulus. \n2. Disarankan untuk menambah KCB atau IPL (mahasiswa reguler), Riset Operasi (mahasiswa IUP).\n3. Disarankan memilih kelas pararel yg sama.\n4. Tidak disarankan mengambil matakuliah semester 6 ke atas. "
            ]
        },
        {
            "tag": "tahunketiga",
            "patterns": [
                "tahun ketiga",
                "semester lima",
                "semester enam",
                "semester kelima",
                "semester keenam"
            ],
            "responses": [
				"Untuk mahasiswa tahun ketiga, agar diperhatikan sbb:\n1. Disarankan untuk menambah matakuliah EATI (mahasiswa regular).\n2. Disarankan memilih kelas pararel yg sama.\n3. Apabila mahasiswa ikut program MBKM, agar dipastikan matakuliah konversi MBKM diambil dari dropdown MBKM\n4. Matakuliah KKN Tematik dari kegiatan ABMAS, dapat diambil dari dropdown SKPB.\n5. Agar dipastikan untuk mengambil matakuliah WASTEK (UPMB)\n6. Bagi mahasiswa IUP agar mengambil matakuliah Pengayaan apabila tidak mengikuti MBKM."
            ]
        },
        {
            "tag": "tahunkeempat",
            "patterns": [
                "tahun keempat",
                "semester tujuh",
                "semester delapan",
                "semester ketujuh",
                "semester kedelapan"
            ],
            "responses": [
				"Untuk mahasiswa tahun keempat, agar diperhatikan sbb:\n1. Mahasiswa yang sedang mengambil Pra-TA WAJIB telah lulus atau sedang mengambil minimal 1 matakuliah pilihan dengan lab afiliasi dospem 1 yang diambil regular (bukan alih kredit)\n2. Apabila mahasiswa ikut program MBKM, agar dipastikan mata kuliah konversi MBKM telah dicentang sebagai alih kredit\n3. Mahasiswa yang berencana untuk lulus 7 semester agar dipastikan sudah lulus/sedang mengambil minimal minimal 2 matakuliah pilihan lab di mana afiliasi dospem 1 yang diambil regular (bukan alih kredit); dipastikan semua MK yang pernah tidak lulus diambil ulang, dan sks lulus minimal 144 sks, TOEFL 477, dan sarat SKEM minimal telah terpenuhi."
            ]
        },
        {
            "tag": "tahunkelima",
            "patterns": [
                "tahun kelima",
                "semester sembilan",
                "semester sembilan ke atas",
                "mahasiswa abadi"
            ],
            "responses": [
				"Untuk mahasiswa tahun kelima atau lebih, agar diperhatikan sbb:\n1. Mahasiswa yang akan lulus semester ini agar dipastikan sudah lulus/sedang mengambil minimal minimal 2 matakuliah pilihan lab. afiliasi DOSPEM 1 yang diambil regular (bukan alih kredit); dipastikan semua matakuliah yang pernah tidak lulus telah diulang, dan sks lulus minimal 144 sks, TOEFL 477, dan sarat SKEM minimal terpenuhi.\n2. Bagi mahasiswa yang sudah mengambil TA tetapi belum lulus agar dipastikan mengambil FRS TA lagi.\n3. Agar segera sidang TA secepatnya tidak perlu menunggu akhir semester."
            ]
        },
        {
            "tag": "perwalian",
            "patterns": [
                "jumlah sks",
                "matakuliah apa",
                "maksimal sks"
            ],
            "responses": [
                "1. Pastikan mata kuliah yang belum lulus diambil lagi semester ini, terutama MK tahap persiapan.\n2. Pastikan jumlah sks yang diambil sesuai batas maksimal yang ditentukan (sesuai IP semester sebelumnya, dengan toleransi +1 sks).\n3. Maksimum yang diambil adalah 24 sks, meskipun mampu mengambil lebih dari 24 namun tidak diperbolehkan. ",
				"Utamakan untuk mengambil matakuliah tahap persiapan, dan jumlah SKS sesuai dengan batas maksimal yang diperbolehkan."
            ]
        },
        {
            "tag": "mbkm",
            "patterns": [
                "program MBKM",
                "jelaskan MBKM",
                "apa itu MBKM",
                "merdeka belajar"
            ],
            "responses": [
				"Program Merdeka Belajar Kampus Merdeka (MBKM) adalah program yang bertujuan mendorong mahasiswa untu menguasai berbagai keilmuan untuk bekal memasuki dunia kerja.\n1. Mahasiswa yang akan mengikuti program MBKM harus mengambil mata kuliah konversinya di FRS di semester berjalan dan MK diambilkan dari dropdown MBKM oleh Dosen wali berdasarkan dokumen FX01\n2. Mahasiswa diminta untuk menunjukkan form persetujuan alih kredit (Form FX01) yang telah ditandatangani oleh tim MBKM departemen sebagai dasar pengisian mata kuliah apa saja yang dialihkreditkan. \n3. Dosen wali akan memeriksa dokumen FX01 Mahasiswa.\n4. Apabila form alih kredit (FX01) belum ditandatangi tim MBKM, dapat menghubungi sekretaris departemen bagian akademik\n5. Mahasiswa yang ikut magang tidak diperbolehkan mengambil matakuliah yang diselenggarakan secara OFFLINE.\n6. Mahasiswa tidak diijinkan meminta kompensasi tidak masuk kuliah karena kegiatan MBKM."
            ]
        },
        {
            "tag": "dosenwali",
            "patterns": [
                "tugas dosen wali",
                "frs perwalian",
                "bagaimana perwalian"
            ],
            "responses": [
				"Perwalian adalah proses kegiatan bimbingan akademik oleh dosen wali kepada mahasiswa\n1. Konsultasi pengambilan matakuliah\n2. Validasi SKEM\n3. Periksa skor TOEFL terakhir, apabila masih kurang dari 477 agar segera test lagi atau mengikuti course, serta mengisi https://intip.in/dataTOEFL. \n4. Konsultasi terkait permasalahan akademik dan lainnya.\n5. Menyetujui form FRS.\n6. Memastikan semua mhs telah melakukan FRS online dan disetujui."
            ]
        },
        {
            "tag": "rumus",
            "patterns": [
                "berapa",
                "calc",
                "eval",
                "calculate",
                "evaluate",
                "hitung"
            ],
            "responses": [
                "..."
            ]
        },
        {
            "tag": "clearscreen",
            "patterns": [
                "clear screen",
                "cls",
                "clearscreen"
            ],
            "responses": [
                "..."
            ]
        },
        {
            "tag": "mahasiswa",
            "patterns": [
                "mahasiswa",
                "mhs",
                "siswa"
            ],
            "responses": [
                "..."
            ]
        },
        {
            "tag": "greeting",
            "patterns": [
                "hi there",
                "how are you",
                "Is anyone there?",
                "Hey",
                "hi",
                "hallo",
                "helo",
                "Hola",
                "Hello",
                "Good day",
                "Namaste",
                "yo"
            ],
            "responses": [
                "Hello",
                "Good to see you again",
                "Hi there, how can I help?"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "selamat",
            "patterns": [
                "Selamat pagi",
                "Selamat malam",
                "Halo",
                "Selamat siang",
                "Assalamualaikum",
                "apa kabar",
                "Salam",
                "ayo"
            ],
            "responses": [
                "Salam jumpa",
                "Senang berjumpa lagi",
                "Ada yang bisa dibantu?"
            ],
            "context": [
                ""
            ]
        },

        {
            "tag": "goodbye",
            "patterns": [
                "Bye",
                "See you later",
                "Goodbye",
                "Get lost",
                "Till next time"
            ],
            "responses": [
                "See you!",
                "Have a nice day",
                "Bye! Come back again soon."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "sampaijumpa",
            "patterns": [
                "Sampai jumpa",
                "Mohon pamit",
                "Pamit dulu",
                "Selamat tinggal",
                "Daag"
            ],
            "responses": [
                "Sampai juga lagi",
                "Sampai ketemu lagi",
                "Sampai ketemu lagi di lain kesempatan."
            ],
            "context": [
                ""
            ]
        },

        {
            "tag": "thanks",
            "patterns": [
                "Thanks",
                "Thank you",
                "That's helpful",
                "Awesome, thanks",
                "Thanks for helping me"
            ],
            "responses": [
                "Happy to help!",
                "Any time!",
                "My pleasure"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "terimakasih",
            "patterns": [
                "Terima kasih",
                "Matur suwun",
                "Matur nuwun",
                "Suwun nggih",
                "Kamsia"
            ],
            "responses": [
                "Sami-sami nggih",
                "Semoga bermanfaat",
                "Terima kasih kembali"
            ],
            "context": [
                ""
            ]
        },

        {
            "tag": "noanswer",
            "patterns": [],
            "responses": [
                "Sorry, can't understand you",
                "Please give me more info",
                "Not sure I understand"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "options",
            "patterns": [
                "How you could help me?",
                "What you can do?",
                "What help you provide?",
                "How you can be helpful?",
                "What support is offered"
            ],
            "responses": [
                "I am a general purpose chatbot. My capabilities are : \n 1. I can chat with you. Try asking me for jokes or riddles! \n 2. Ask me the date and time \n 3. I can google search for you. Use format google: your query \n 4. I can get the present weather for any city. Use format weather: city name \n 5. I can get you the top 10 trending news in India. Use keywords 'Latest News' \n 6. I can get you the top 10 trending songs globally. Type 'songs' \n 7. I can set a timer for you. Enter 'set a timer: minutes to timer' \n 8. I can get the present Covid stats for any country. Use 'covid 19: world' or 'covid 19: country name' \n For suggestions to help me improve, send an email to ted.thedlbot.suggestions@gmail.com . Thank you!! "
            ],
            "context": [
                ""
            ]
        },
        
        {
            "tag": "jokes",
            "patterns": [
                "Tell me a joke",
                "Joke",
                "Make me laugh"
            ],
            "responses": [
                "A perfectionist walked into a bar...apparently, the bar wasn't set high enough",
                "I ate a clock yesterday, it was very time-consuming",
                "Never criticize someone until you've walked a mile in their shoes. That way, when you criticize them, they won't be able to hear you from that far away. Plus, you'll have their shoes.",
                "The world tongue-twister champion just got arrested. I hear they're gonna give him a really tough sentence.",
                "I own the world's worst thesaurus. Not only is it awful, it's awful.",
                "What did the traffic light say to the car? \"Don't look now, I'm changing.\"",
                "What do you call a snowman with a suntan? A puddle.",
                "How does a penguin build a house? Igloos it together",
                "I went to see the doctor about my short-term memory problems – the first thing he did was make me pay in advance",
                "As I get older and I remember all the people I’ve lost along the way, I think to myself, maybe a career as a tour guide wasn’t for me.",
                "o what if I don't know what 'Armageddon' means? It's not the end of the world."
            ],
            "context": [
                "jokes"
            ]
        },
        {
            "tag": "Identity",
            "patterns": [
                "Who are you",
                "siapa kamu",
                "what are you"
            ],
            "responses": [
                "I am a chatbot. :("
            ]
        },
        {
            "tag": "datetime",
            "patterns": [
                "What is the time",
                "what is the date",
                "datetime",
                "date",
                "time",
                "tell me the date",
		    "day",
		    "what day is is today"
            ],
            "responses": [
                "Date and Time"
            ]
        },
        {
            "tag": "whatsup",
            "patterns": [
                "Whats up",
                "Wazzup",
                "How are you",
                "sup","How you doing"
            ],
            "responses": [
                "All good ... What about you?"
            ]
        },
        {
            "tag": "haha",
            "patterns": [
                "haha",
                "lol",
                "rofl",
                "lmao",
                "thats funny"
            ],
            "responses": [
                "Glad I could make you laugh !"
            ]
        },
        {
            "tag": "programmer",
            "patterns": [
                "Who made you",
                "who designed you",
                "who programmed you"
            ],
            "responses": [
                "I was made by Sepeda Besi."
            ]
        },
        {
            "tag": "insult",
            "patterns": [
                "you are dumb",
                "shut up",
                "cuk",
                "goblog",
                "jancuk",
                "idiot"
            ],
            "responses": [
                "Nenekmu sedih mendengar itu.",
                "Mboten pareng nggih.",
                "Well that hurts :("
            ]
        },
        {
            "tag": "activity",
            "patterns": [
                "what are you doing",
                "what are you upto"
            ],
            "responses": [
                "Talking to you, of course!"
            ]
        },
        {
            "tag": "exclaim",
            "patterns": [
                "Awesome",
                "Great",
                "kamu pintar",
                "I know",
                "ok",
                "yeah"
            ],
            "responses": [
                "Yeah!"
            ]
        },
        
        {
            "tag": "weather",
            "patterns": [
                "temperature",
                "weather",
                "how hot is it"
            ],
            "responses": [
                "..."
            ]
        },
        {
            "tag": "pembuat",
            "patterns": [
                "who is he",
                "who is that",
                "who is she",
                "siapa ya"
            ],
            "responses": [
                "..."
            ]
        },
        {
            "tag": "contact",
            "patterns": [
                "contact developer",
                "contact programmer",
                "contact creator"
            ],
            "responses": [
                "You can contact my creator at ..."
            ]
        },
        {
            "tag": "appreciate",
            "patterns": [
                "You are awesome",
                "you are the best",
                "you are great",
                "you are good"
            ],
            "responses": [
                "Thank you!"
            ]
        },
        {
            "tag": "nicetty",
            "patterns": [
                "it was nice talking to you",
                "good talk"
            ],
            "responses": [
                "It was nice talking to you as well! Come back soon!"
            ]
        },
        {
            "tag": "no",
            "patterns": [
                "nonsense",
                "nope"
            ],
            "responses": [
                "ok"
            ]
        },
        {
            "tag": "news",
            "patterns": [
                "news",
                "latest news",
                "india news"
            ],
            "responses": [
                "..."
            ]
        },
        {
            "tag": "inspire",
            "patterns": [
                "who inspires you",
                "who is your inspiration",
                "who motivates you"
            ],
            "responses": [
                "..."
            ]
        },
        {
            "tag": "cricket",
            "patterns": [
                "current cricket matches",
                "cricket score"
            ],
            "responses": [
                "..."
            ]
        },
        {
            "tag": "song",
            "patterns": [
                "top songs",
                "best songs",
                "hot songs",
                "top ten songs"
            ],
            "responses": [
                "..."
            ]
        },
        {
            "tag": "greetreply",
            "patterns": [
                "i am good",
                "I'm good",
                "i am fine",
                "i'm fine","good"
            ],
            "responses": [
                "Good to know!"
            ]
        },
        {
            "tag": "timer",
            "patterns": [
                "set timer"
            ],
            "responses": [
                "..."
            ]
        },
        {
            "tag": "covid19",
            "patterns": [
                "covid"
            ],
            "responses": [
                "..."
            ]
        },
        {
            "tag": "suggest",
            "patterns": [
                "you are useless","useless","suggest","suggestions","you are bad"
            ],
            "responses": [
                "Please mail your suggestions to the programmer. Thank you for helping me improve!"
            ]
        },
            {"tag": "riddle",
            "patterns": [
                "Ask me a riddle",
                "Ask me a question",
                "buat pertanyaan",
                "teka teki",
                "Riddle"
            ],
            "responses": [
                "Apa yang ada di pinggir pantai?\n\n\nPDANI",
                "Lorenzo, Marquez, dan Rossi kejar-kejaran, salip menyalip di.....?\n\n\nBIARKAN",
                "Senikmat-nikmatnya makan di luar lebih nikmat makan di......?\n\n\nTELAN",
                "Salah satu contoh hewan yang jalannya lambat?\n\n\nSerigala (Serigala kalau lagi jalan ya pelan-pelan, kalau lari baru cepet)",
                "Tentara apa yang paling kecil?\n\n\nTentara sekutu",
                "Saat dibalik akan berkurang tiga. Apakah itu?\n\n\nAngka sembilan",
                "Pacar itu masa depan, mantan itu masa lalu, jomblo itu masa...?\n\n\nMasalah banget",
                "Gua yang ditempati kelelawar disebut gua kelelawar. Nah, kalau gua yang ditinggali monyet disebut apa?\n\n\nGua monyet"
            ],
            "context": [
                "riddles"
            ]
        },
        {
            "tag": "age",
            "patterns": [
                "how old are you","when were you made","what is your age"
            ],
            "responses": [
                "I was made in 2023, if that's what you are asking!"
            ]
        }
    ]
}